In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:viswaa@localhost

In [7]:
%%sql
create database besant;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[]

In [8]:
%%sql
use besant;
create table student (
    id int primary key,
    name varchar(50),
    age int,
    city varchar(50)
);

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
0 rows affected.

[]

In [10]:
%%sql
describe student;

 * mysql+mysqlconnector://root:***@localhost
4 rows affected.

[('id', 'int', 'NO', 'PRI', None, ''),
 ('name', 'varchar(50)', 'YES', '', None, ''),
 ('age', 'int', 'YES', '', None, ''),
 ('city', 'varchar(50)', 'YES', '', None, '')]

In [3]:
%%sql
use besant;
SELECT * FROM EMPLOYEE;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
2 rows affected.

[(1, 'VISWAA', 'VISWAAESWARAN@GMAIL.COM', 21, 'ACTIVE'),
 (2, 'SATHISH', 'SATHISH@GMAIL.COM', 22, 'active')]

In [8]:
%%sql
use besant;
SELECT * FROM EMPLOYEESS;
##1.Find employees whose salary is greater than 60,000.
select * from employeess where salary > 60000;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
10 rows affected.
6 rows affected.

[(1, 'Amit Kumar', 28, 'M', 'IT', 'Software Engineer', Decimal('65000.00'), 'Bengaluru', datetime.date(2020, 3, 15), 4),
 (4, 'Pooja Singh', 29, 'F', 'IT', 'UI Designer', Decimal('72000.00'), 'Delhi', datetime.date(2020, 10, 5), 5),
 (5, 'Vivek Reddy', 35, 'M', 'Operations', 'Manager', Decimal('90000.00'), 'Hyderabad', datetime.date(2018, 2, 12), 8),
 (7, 'Arjun Mehta', 31, 'M', 'IT', 'Team Lead', Decimal('85000.00'), 'Chennai', datetime.date(2019, 12, 1), 7),
 (9, 'Rohit Verma', 30, 'M', 'Finance', 'Senior Accountant', Decimal('67000.00'), 'Delhi', datetime.date(2020, 1, 25), 5),
 (10, 'Divya Nair', 33, 'F', 'Operations', 'Supervisor', Decimal('75000.00'), 'Bengaluru', datetime.date(2019, 6, 14), 7)]

In [9]:
%%sql
##2.Display employees whose age is less than 30.
SELECT * FROM employeess WHERE Age < 30;

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(1, 'Amit Kumar', 28, 'M', 'IT', 'Software Engineer', Decimal('65000.00'), 'Bengaluru', datetime.date(2020, 3, 15), 4),
 (2, 'Riya Sharma', 26, 'F', 'HR', 'HR Executive', Decimal('48000.00'), 'Mumbai', datetime.date(2021, 5, 10), 3),
 (4, 'Pooja Singh', 29, 'F', 'IT', 'UI Designer', Decimal('72000.00'), 'Delhi', datetime.date(2020, 10, 5), 5),
 (6, 'Sneha Gupta', 27, 'F', 'Marketing', 'Marketing Analyst', Decimal('55000.00'), 'Pune', datetime.date(2021, 9, 17), 3),
 (8, 'Neha Joshi', 24, 'F', 'HR', 'Recruiter', Decimal('42000.00'), 'Kolkata', datetime.date(2022, 4, 10), 2)]

In [10]:
%%sql
## 3.Find employees who have exactly 5 years of experience.
SELECT * FROM employeess WHERE Experience = 5;

 * mysql+mysqlconnector://root:***@localhost
2 rows affected.

[(4, 'Pooja Singh', 29, 'F', 'IT', 'UI Designer', Decimal('72000.00'), 'Delhi', datetime.date(2020, 10, 5), 5),
 (9, 'Rohit Verma', 30, 'M', 'Finance', 'Senior Accountant', Decimal('67000.00'), 'Delhi', datetime.date(2020, 1, 25), 5)]

In [11]:
%%sql
SELECT * FROM employeess WHERE Join_Date < '2020-01-01';

 * mysql+mysqlconnector://root:***@localhost
4 rows affected.

[(3, 'Karan Patel', 32, 'M', 'Finance', 'Accountant', Decimal('58000.00'), 'Ahmedabad', datetime.date(2019, 8, 20), 6),
 (5, 'Vivek Reddy', 35, 'M', 'Operations', 'Manager', Decimal('90000.00'), 'Hyderabad', datetime.date(2018, 2, 12), 8),
 (7, 'Arjun Mehta', 31, 'M', 'IT', 'Team Lead', Decimal('85000.00'), 'Chennai', datetime.date(2019, 12, 1), 7),
 (10, 'Divya Nair', 33, 'F', 'Operations', 'Supervisor', Decimal('75000.00'), 'Bengaluru', datetime.date(2019, 6, 14), 7)]

In [12]:
%%sql
SELECT * FROM employeess WHERE Salary <> 55000;

 * mysql+mysqlconnector://root:***@localhost
9 rows affected.

[(1, 'Amit Kumar', 28, 'M', 'IT', 'Software Engineer', Decimal('65000.00'), 'Bengaluru', datetime.date(2020, 3, 15), 4),
 (2, 'Riya Sharma', 26, 'F', 'HR', 'HR Executive', Decimal('48000.00'), 'Mumbai', datetime.date(2021, 5, 10), 3),
 (3, 'Karan Patel', 32, 'M', 'Finance', 'Accountant', Decimal('58000.00'), 'Ahmedabad', datetime.date(2019, 8, 20), 6),
 (4, 'Pooja Singh', 29, 'F', 'IT', 'UI Designer', Decimal('72000.00'), 'Delhi', datetime.date(2020, 10, 5), 5),
 (5, 'Vivek Reddy', 35, 'M', 'Operations', 'Manager', Decimal('90000.00'), 'Hyderabad', datetime.date(2018, 2, 12), 8),
 (7, 'Arjun Mehta', 31, 'M', 'IT', 'Team Lead', Decimal('85000.00'), 'Chennai', datetime.date(2019, 12, 1), 7),
 (8, 'Neha Joshi', 24, 'F', 'HR', 'Recruiter', Decimal('42000.00'), 'Kolkata', datetime.date(2022, 4, 10), 2),
 (9, 'Rohit Verma', 30, 'M', 'Finance', 'Senior Accountant', Decimal('67000.00'), 'Delhi', datetime.date(2020, 1, 25), 5),
 (10, 'Divya Nair', 33, 'F', 'Operations', 'Supervisor', Decimal('75000.00'), 'Bengaluru', datetime.date(2019, 6, 14), 7)]

In [13]:
%%sql
SELECT * FROM EMPLOYEES WHERE AGE BETWEEN 25 AND 30;

 * mysql+mysqlconnector://root:***@localhost
28 rows affected.

[(1, 'Aarav Mehta', 28, 'M', 'IT', 'Developer', 60000, 'Bengaluru', datetime.date(2020, 5, 12), 3),
 (3, 'Ravi Kumar', 26, 'M', 'Finance', 'Analyst', 52000, 'Delhi', datetime.date(2021, 2, 15), 2),
 (4, 'Sneha Rao', 30, 'F', 'IT', 'Tester', 55000, 'Hyderabad', datetime.date(2019, 7, 1), 4),
 (6, 'Anjali Verma', 27, 'F', 'Marketing', 'Executive', 48000, 'Pune', datetime.date(2021, 5, 17), 2),
 (8, 'Divya Patel', 29, 'F', 'Finance', 'Accountant', 58000, 'Ahmedabad', datetime.date(2019, 6, 25), 4),
 (11, 'Sahil Jain', 25, 'M', 'IT', 'Developer', 50000, 'Chandigarh', datetime.date(2022, 1, 10), 1),
 (12, 'Meena Das', 28, 'F', 'Marketing', 'Analyst', 49000, 'Kolkata', datetime.date(2020, 11, 18), 3),
 (14, 'Priya Reddy', 29, 'F', 'Sales', 'Executive', 47000, 'Hyderabad', datetime.date(2021, 9, 22), 2),
 (16, 'Aditi Joshi', 27, 'F', 'Finance', 'Clerk', 42000, 'Mumbai', datetime.date(2022, 4, 11), 1),
 (18, 'Riya Kapoor', 30, 'F', 'HR', 'Executive', 56000, 'Chennai', datetime.date(2019, 12, 19), 4),
 (19, 'Arun Bhat', 29, 'M', 'IT', 'Tester', 53000, 'Kochi', datetime.date(2020, 8, 8), 3),
 (20, 'Kavya Menon', 26, 'F', 'IT', 'Developer', 58000, 'Bengaluru', datetime.date(2021, 3, 15), 2),
 (23, 'Raman Kaur', 28, 'M', 'IT', 'Support', 50000, 'Amritsar', datetime.date(2020, 10, 25), 3),
 (25, 'Tarun Patel', 27, 'M', 'Marketing', 'Executive', 49000, 'Ahmedabad', datetime.date(2021, 7, 7), 2),
 (28, 'Leena George', 28, 'F', 'IT', 'Developer', 60000, 'Chennai', datetime.date(2019, 5, 5), 4),
 (29, 'Rohit Das', 26, 'M', 'Marketing', 'Executive', 48000, 'Kolkata', datetime.date(2021, 2, 2), 2),
 (31, 'Yash Agarwal', 25, 'M', 'IT', 'Intern', 30000, 'Pune', datetime.date(2023, 2, 1), 0),
 (32, 'Sana Khan', 29, 'F', 'Sales', 'Executive', 50000, 'Hyderabad', datetime.date(2020, 6, 1), 3),
 (33, 'Aditya Rao', 30, 'M', 'Marketing', 'Analyst', 55000, 'Bengaluru', datetime.date(2019, 3, 11), 4),
 (34, 'Renu Jain', 28, 'F', 'HR', 'Executive', 52000, 'Chennai', datetime.date(2020, 12, 20), 3),
 (37, 'Simran Gill', 26, 'F', 'Sales', 'Executive', 49000, 'Delhi', datetime.date(2021, 4, 19), 2),
 (39, 'Ankita Roy', 29, 'F', 'Marketing', 'Manager', 71000, 'Kolkata', datetime.date(2018, 6, 8), 5),
 (41, 'Priti Nair', 27, 'F', 'IT', 'Developer', 57000, 'Bengaluru', datetime.date(2021, 6, 12), 2),
 (42, 'Harsh Gupta', 30, 'M', 'IT', 'Tester', 54000, 'Delhi', datetime.date(2019, 9, 5), 4),
 (45, 'Anu Pillai', 29, 'F', 'HR', 'Recruiter', 50000, 'Chennai', datetime.date(2021, 1, 12), 2),
 (46, 'Parth Shah', 28, 'M', 'Marketing', 'Analyst', 55000, 'Ahmedabad', datetime.date(2019, 2, 2), 4),
 (48, 'Rohan Joshi', 27, 'M', 'IT', 'Developer', 58000, 'Bengaluru', datetime.date(2021, 8, 8), 2),
 (49, 'Mitali Jain', 30, 'F', 'HR', 'Manager', 80000, 'Pune', datetime.date(2016, 10, 10), 8)]

In [14]:
%%sql
SELECT * FROM EMPLOYEES WHERE HIRE_DATE BETWEEN '2018-01-01' AND '2020-12-31';

 * mysql+mysqlconnector://root:***@localhost
20 rows affected.

[(1, 'Aarav Mehta', 28, 'M', 'IT', 'Developer', 60000, 'Bengaluru', datetime.date(2020, 5, 12), 3),
 (2, 'Neha Sharma', 32, 'F', 'HR', 'Manager', 75000, 'Mumbai', datetime.date(2018, 3, 10), 6),
 (4, 'Sneha Rao', 30, 'F', 'IT', 'Tester', 55000, 'Hyderabad', datetime.date(2019, 7, 1), 4),
 (8, 'Divya Patel', 29, 'F', 'Finance', 'Accountant', 58000, 'Ahmedabad', datetime.date(2019, 6, 25), 4),
 (9, 'Karan Gupta', 31, 'M', 'IT', 'Developer', 61000, 'Delhi', datetime.date(2018, 1, 19), 5),
 (12, 'Meena Das', 28, 'F', 'Marketing', 'Analyst', 49000, 'Kolkata', datetime.date(2020, 11, 18), 3),
 (17, 'Nikhil Das', 31, 'M', 'Marketing', 'Manager', 72000, 'Delhi', datetime.date(2018, 2, 12), 5),
 (18, 'Riya Kapoor', 30, 'F', 'HR', 'Executive', 56000, 'Chennai', datetime.date(2019, 12, 19), 4),
 (19, 'Arun Bhat', 29, 'M', 'IT', 'Tester', 53000, 'Kochi', datetime.date(2020, 8, 8), 3),
 (23, 'Raman Kaur', 28, 'M', 'IT', 'Support', 50000, 'Amritsar', datetime.date(2020, 10, 25), 3),
 (26, 'Shruti Ghosh', 31, 'F', 'Finance', 'Accountant', 57000, 'Kolkata', datetime.date(2018, 9, 9), 5),
 (28, 'Leena George', 28, 'F', 'IT', 'Developer', 60000, 'Chennai', datetime.date(2019, 5, 5), 4),
 (32, 'Sana Khan', 29, 'F', 'Sales', 'Executive', 50000, 'Hyderabad', datetime.date(2020, 6, 1), 3),
 (33, 'Aditya Rao', 30, 'M', 'Marketing', 'Analyst', 55000, 'Bengaluru', datetime.date(2019, 3, 11), 4),
 (34, 'Renu Jain', 28, 'F', 'HR', 'Executive', 52000, 'Chennai', datetime.date(2020, 12, 20), 3),
 (35, 'Gaurav Mishra', 33, 'M', 'Finance', 'Clerk', 46000, 'Pune', datetime.date(2018, 10, 17), 5),
 (39, 'Ankita Roy', 29, 'F', 'Marketing', 'Manager', 71000, 'Kolkata', datetime.date(2018, 6, 8), 5),
 (42, 'Harsh Gupta', 30, 'M', 'IT', 'Tester', 54000, 'Delhi', datetime.date(2019, 9, 5), 4),
 (43, 'Monika Singh', 31, 'F', 'Marketing', 'Executive', 49000, 'Lucknow', datetime.date(2020, 11, 15), 3),
 (46, 'Parth Shah', 28, 'M', 'Marketing', 'Analyst', 55000, 'Ahmedabad', datetime.date(2019, 2, 2), 4)]

In [15]:
%%SQL 
SELECT * FROM EMPLOYEES WHERE AGE BETWEEN 30 AND 40 AND DEPARTMENT = 'Sales';

UsageError: Cell magic `%%SQL` not found.